# SymbolicCutbackForBrace Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
StructuralSettings..::..SymbolicCutbackForBrace Property
StructuralSettings Class See Also
---
Symbolic cutback distance to be applied to all braces.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double SymbolicCutbackForBrace { get; set; }
```

Visual Basic
---
```text
Public Property SymbolicCutbackForBrace As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SymbolicCutbackForBrace {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace